БухЭксп/Reports/CW_ЛичныйКабинетСтатистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ЛичныйКабинетСтатистика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Reports/CW_ЛичныйКабинетСтатистика/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВнешняяТаблица = ПолучитьТаблицуДанныхЛичногоКабинета(); 
	Если ВнешняяТаблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатыПериода = ПолучитьДатыПериода();
	
	//Программно формируем отчет
	Схема					= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.ВариантыНастроек.Найти(ВариантОтчета).Настройки);
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	//Формат шаклы точек
	ФорматыТочек = ФорматыТочекОтчета();
	СтрокаФормата= ФорматыТочек.Получить(Периодичность);
	
	ЭлементОформления = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	
	ПолеОфрмления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОфрмления.Использование = Истина;
	ПолеОфрмления.Поле = Новый ПолеКомпоновкиДанных("Дата");
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", СтрокаФормата);	
	//Формат шаклы точек
	
	ДанныеРасшифровки		= Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета		= Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки			= КомпоновщикМакета.Выполнить(Схема, НастройкиСКД, ДанныеРасшифровки);
    
    ВнешниеНаборыДанных		= Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаСтатистики",	ВнешняяТаблица);
    ВнешниеНаборыДанных.Вставить("ДатыПериода",			ДатыПериода);
    
    //Инициализируем процессор компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	ДокументРезультат.Очистить();
    
    //Выводим отчет в документ
    ПроцессорВывода = Новый
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	

	
КонецПроцедуры

Функция ПолучитьДатыПериода()
	
	Соответствие = ПериодичностьОтчета();
	ПериодичностьОтчета =  Соответствие.Получить(Периодичность);
	
	ДатыПериода = Новый ТаблицаЗначений;
	ДатыПериода.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,,новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	ТекущееЗначение 	= ПолучитьНачалоПериода(НачалоПериода, ПериодичностьОтчета);
	ПоследнееЗначение 	= ПолучитьКонецПериода(КонецПериода, ПериодичностьОтчета);
	
	Пока ТекущееЗначение <= ПоследнееЗначение Цикл
		
		СтрокаДат = ДатыПериода.Добавить();
		СтрокаДат.Дата = ТекущееЗначение;
		
		ТекущееЗначение = ПолучитьСледующуюДату(ТекущееЗначение, ПериодичностьОтчета);
		
	КонецЦикла;
	
	Возврат ДатыПериода;
	
КонецФункции

Функция ПолучитьНачалоПериода(ТекущееЗначение, ПериодичностьОтчета)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(&ТекущееЗначение, "+ПериодичностьОтчета+") КАК ОчередноеЗначение";
	
	Запрос.УстановитьПараметр("ТекущееЗначение", ТекущееЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ОчередноеЗначение;
	
КонецФункции

Функция ПолучитьКонецПериода(ТекущееЗначение, ПериодичностьОтчета)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОНЕЦПЕРИОДА(&ТекущееЗначение, "+ПериодичностьОтчета+") КАК ОчередноеЗначение";
	
	Запрос.УстановитьПараметр("ТекущееЗначение", ТекущееЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ОчередноеЗначение;
	
КонецФункции


Функция ПолучитьСледующуюДату(ТекущееЗначение, ПериодичностьОтчета)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДОБАВИТЬКДАТЕ(&ТекущееЗначение, "+ПериодичностьОтчета+", 1) КАК ОчередноеЗначение";
	
	Запрос.УстановитьПараметр("ТекущееЗначение", ТекущееЗначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ОчередноеЗначение;
	
КонецФункции

Функция ФорматыТочекОтчета()
	
	Результат = Новый Соответствие;
	Результат.Вставить(0, "ДФ='yyyy ""г.""'");
	Результат.Вставить(1, "ДФ='к ""квартал"" yyyy ""г.""'");
	Результат.Вставить(2, "ДФ='MMMM yyyy ""г.""'");
	Результат.Вставить(3, "ДФ=dd.MM.yyyy");
	Результат.Вставить(4, "ДФ='dd.MM.yyyy hh:mm'");
	Результат.Вставить(5, "ДФ='dd.MM.yyyy hh:mm'");
	
	Возврат Результат;	
	
КонецФункции

Функция ПериодичностьОтчета()
	
	Результат = Новый Соответствие;
	Результат.Вставить(0, "ГОД");
	Результат.Вставить(1, "КВАРТАЛ");
	Результат.Вставить(2, "МЕСЯЦ");
	Результат.Вставить(3, "ДЕНЬ");
	Результат.Вставить(4, "ЧАС");
	Результат.Вставить(5, "МИНУТА");
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьТаблицуДанныхЛичногоКабинета()
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
	
	СтруктураJSON = Новый  Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("startdate",	XMLСтрока(НачалоДня(НачалоПериода)));
	СтруктураJSON.Вставить("enddate", 	XMLСтрока(КонецДня(КонецПериода)));
	СтруктураJSON.Вставить("period", 	XMLСтрока(Периодичность));  
	СтруктураJSON.Вставить("user", 		XMLСтрока(Пользователь.ЭлектроннаяПочта));  
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_statistics", СтруктураJSON);
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
	Если  Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда   
		СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ); 
		ХранилищеЗначения = XMLЗначение(Тип("ХранилищеЗначения"), СтруктураJSON.statistics);
		Возврат ХранилищеЗначения.Получить();
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

#КонецЕсли
